---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConstantHeightNotParallelError
source: html/dd15f6a8-4391-c33c-ec2b-59683008880c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.ConstantHeightNotParallelError Property

Constant-height-defining lines must be parallel.

## Syntax (C#)
```csharp
public static FailureDefinitionId ConstantHeightNotParallelError { get; }
```